{"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2023/02/19/hello-world/"},{"title":"test_my_site","text":"","link":"/2023/02/19/test-my-site/"}],"tags":[],"categories":[],"pages":[{"title":"论文&amp;项目","text":"已发表论文Automatic Arabic Grammar Correction based on Expectation Maximization Routing and Target-Bidirectional AgreementAiman Solyman, Zhenyu Wang, Qian Tao, Arafat Abdulgader, Rui Zhang, and Zeinab Aleibieid. In Knowledge-Based Systems, 2022. (CCF-C类期刊, JCR Q1, IF=8.139) Emotion-Sensitive Deep Dyna-Q Learning for Task-Completion Dialogue Policy LearningRui Zhang, Zhenyu Wang, Mengdan Zheng, Yangyang Zhao, and Zhenhua Huang. In Neurocomputing, 2021. (CCF-C类期刊, JCR Q1, IF=4.438) Predicting Emotion Reactions for Human-Computer Conversation: A Variational ApproachRui Zhang, Zhenyu Wang, Zhenhua Huang, Li Li, and Mengdan Zheng. In IEEE Transactions on Human-Machine Systems, 2021. (CCF-B类期刊, JCR Q1, IF=3.374) Melodic Phrase Attention Network for Symbolic Data-based Music Genre Classification (Student Abstract)Li Li, Rui Zhang, and Zhenyu Wang. In Proceedings of the AAAI Conference on Artificial Intelligence (AAAI), 2021. (CCF-A类会议) Learning Bi-directional Social Influence in Information Cascades using Graph Sequence Attention NetworksZhenhua Huang , Zhenyu Wang , Rui Zhang, Yangyang Zhao, and Dongfa Zheng. In Companion Proceedings of the Web Conference (WWW), 2020. (CCF-A类会议) Dynamic Reward-based Dueling Deep Dyna-Q: Robust Policy Learning in Noisy EnvironmentsYangyang Zhao, Zhenyu Wang, Kai Yin, Rui Zhang, and Zhenhua Huang. In Proceedings of the AAAI Conference on Artificial Intelligence (AAAI), 2020. (CCF-A 类会议) 基于大规模结构化病例数据的新型冠状病毒传播特征和感染人群分析黄振华, 王振宇, 江莉, 张睿, 雷昶, 刘星炜, and 谢晓辉. In 中国科学: 信息科学, 2020. (CCF-A类中文期刊) 任务型对话系统研究综述赵阳洋, 王振宇, 王佩, 杨添, 张睿, and 尹凯. In 计算机学报, 2020. (CCF-A类中文期刊) Emotional Text Generation Based on Cross-Domain Sentiment TransferRui Zhang, Zhenyu Wang, Kai Yin, and Zhenhua Huang. In IEEE Access, 2019. (JCR Q1期刊, IF=3.745) Cascade2vec: Learning Dynamic Cascade Representation by Recurrent Graph Neural NetworksZhenhua Huang, Zhenyu Wang, and Rui Zhang. In IEEE Access, 2019. (JCR Q1期刊, IF=3.745) 基于标签深度分析的音乐自动标注算法王振宇, 张睿, 高雨轩, and 萧永乐. In 华南理工大学学报 (自然科学版), 2019. (EI-中文期刊) Learning to Converse Emotionally Like Humans: A Conditional Variational ApproachRui Zhang and Zhenyu Wang. In CCF International Conference on Natural Language Processing and Chinese Computing (NLPCC), 2018. (CCF-C类会议) Building Emotional Conversation Systems using Multi-task Seq2Seq LearningRui Zhang, Zhenyu Wang, and Dongcheng Mai. In CCF International Conference on Natural Language Processing and Chinese Computing (NLPCC), 2017. (CCF-C类会议) MMCRD: An Effective Algorithm for Deploying Monitoring Point on Social NetworkZehao Guo, Zhenyu Wang, and Rui Zhang. In China Conference on Knowledge Graph and Semantic Computing (CCKS), 2018.(EI会议)","link":"/papers/index.html"},{"title":"关于我","text":"我目前在华为技术有限公司担任高级工程师、AI算法研究员，主要涉及智能对话、人工智能生成内容（AIGC）、自然语言处理等研究方向。于2021年获得华南理工大学软件工程直攻博士学位；于2015年获得华南理工大学软件工程工学学士学位。过往的研究方向主要涉及人机对话、强化学习和人工智能等。 以下是我在学术网站上的页面： Google Scholar, Semantic Scholar, DBLP。 研究经历高级工程师、AI算法研究员， 2022.01-至今 &gt; 华为技术有限公司（Huawei） 博士研究生， 2015.09-2021.12 &gt; 华南理工大学（SCUT），软件工程","link":"/about/index.html"}]}